'''
Имеется файл с данными по успеваемости абитуриентов. Он представляет из себя набор строк, где в каждой строке записана следующая информация:

Фамилия;Оценка_по_математике;Оценка_по_физике;Оценка_по_русскому_языку

Поля внутри строки разделены точкой с запятой, оценки — целые числа.

Напишите программу, которая считывает исходный файл с подобной структурой и для каждого абитуриента записывает его среднюю оценку по трём предметам на отдельной строке, соответствующей этому абитуриенту, в файл с ответом.

Также вычислите средние баллы по математике, физике и русскому языку по всем абитуриентам и добавьте полученные значения, разделённые пробелом, последней строкой в файл с ответом.

В качестве ответа на задание прикрепите полученный файл со средними оценками по каждому ученику и одной строкой со средними оценками по трём предметам.

Примечание. Для разбиения строки на части по символу ';' можно использовать метод split следующим образом:

Sample Input:

Петров;85;92;78
Сидоров;100;88;94
Иванов;58;72;85

Sample Output:

85.0
94.0
71.666666667
81.0 84.0 85.666666667
'''

# Версия №2
text = []
with open('text.txt', 'r', encoding='utf-8') as inf:
    for i in inf:
        buffer = i.strip().split(';')
        text.append(buffer)

math, physic, russian = 0, 0, 0
for i in text:
    print((int(i[1]) + int(i[2]) + int(i[3])) / 3)
    math += int(i[1])
    physic += int(i[2])
    russian += int(i[3])

count_students = len(text)
print(math / count_students, physic / count_students, russian / count_students)
